InformationRegisters/сфпЗаписиТелефонныхПереговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>сфпЗаписиТелефонныхПереговоров</Name>
			<Comment>Записи телефонных переговоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоЗаписи</Name>
					<Comment>Начало записи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВнТелефона</Name>
					<Comment>Номер внутреннего телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Comment>Контакт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьЗаписи</Name>
					<Comment>Продолжительность записи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛинии</Name>
					<Comment>Имя линии звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сфпЗаписиТелефонныхПереговоров/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда
		Отказ = Истина;
	ИначеЕсли Параметры.Свойство("МассивЗаписей") Тогда
		СписокЗаписей = Новый СписокЗначений;
		Для Каждого ЭлементМассива Из Параметры.МассивЗаписей Цикл
			СписокЗаписей.Добавить(ЭлементМассива.ИдентификаторЗаписи);
		КонецЦикла;	
		ЭлементыОтбора = Список.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПоСпискуЗаписей" Тогда
				ЭлементОтбора.ПравоеЗначение = СписокЗаписей;
				ЭлементОтбора.Использование = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		ТекПользователь		= сфпСофтФонПроСервер.сфпТекущийПользователь();
		МассивПользователей	= сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(ТекПользователь);
		СписокПользователей	= Новый СписокЗначений;
		Для Каждого ПользовательМассива Из МассивПользователей Цикл
			СписокПользователей.Добавить(ПользовательМассива);
		КонецЦикла;	
		ЭлементыОтбора = Список.Отбор.Элементы;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПоСпискуПользователей" Тогда
				ЭлементОтбора.ПравоеЗначение = СписокПользователей;
				ЭлементОтбора.Использование = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТД.ИдентификаторЗаписи = "-1" Тогда
		Предупреждение("Отсутствует запись разговора для данного телефонного звонка!");
		Возврат;
	КонецЕсли;	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИдентификаторЗвонка",		ТД.ИдентификаторЗвонка);
	СтруктураЗаписи.Вставить("ИдентификаторЗаписи",		ТД.ИдентификаторЗаписи);
	СтруктураЗаписи.Вставить("НачалоЗаписи",			ТД.НачалоЗаписи);
	СтруктураЗаписи.Вставить("НомерВнТелефона",			ТД.НомерВнТелефона);
	СтруктураЗаписи.Вставить("ИмяЛинии",				ТД.ИмяЛинии);
	Если НЕ (сфпФормаТелефонВнешняяПанель = Неопределено) Тогда
		сфпФормаТелефонВнешняяПанель.ПолучитьФайлРазговора(СтруктураЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
